var calendar = document.getElementById('calendar');
var other = document.querySelector('.used');
var menu = document.querySelector('.blue');

let data = [
    {
        name : "กข99 / หอมคลองหลง 72",
        type : "นาปรัง / นาปัง",
        Yseason : "ปลูกได้ทุกฤดู",
        Nseason : "ไม่มี",
        adv : "ปลูกง่ายขายง่ายได้กำไรไว",
        time : "115วัน"
    },
    {
        name : "ข้าวหอมมะลิ105",
        type : "นาปี",
        Yseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        Nseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        adv : "ทนแล้งทนดินได้หลายชนิดคุณภาพการสีดี",
        time : "120วัน"
    },
    {
        name : "กข103 / หอมชัยนาถ 72",
        type : "นาปี",
        Yseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        Nseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        adv : "กลิ่นหอม เนื้อสัมผัสนุ่ม ปลูกได้หลายพื้นที่ มีความต้านทานโรค",
        time : "120วัน"
    },
    {
        name : "กข111 (เจ้าพระยา72)",
        type : "นาปรัง / นาปัง",
        Yseason : "ปลูกได้ทุกฤดู",
        Nseason : "ไม่มี",
        adv : "ทนทานต่อโรคผลตอบแทนเร็ว",
        time : "100-116วัน"
    },
    {
        name : "ชัยนาถ1",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "เมล็ดยาว คุณภาพดี ผลผลิตสูง",
        time : "110วัน"
    },
    {
        name : "สุพรรณบุรี1",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "ผลผลิตสูง ต้านทานโรค ทนอากาศหนาวเย็น",
        time : "115วัน"
    },
    {
        name : "สุพรรณบุรี3",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "ผลผลิตสูง ต้านทานโรค ทนอากาศหนาวเย็น",
        time : "110วัน"
    },
    {
        name : "พิษณุโลก2",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "ผลผลิตสูง เมล็ดยาว คุณภาพดี",
        time : "105-110วัน"
    },
    {
        name : "ปทุมธานี1",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "มีกลิ่นหอม ต้านทานโรค",
        time : "105-110วัน"
    },
    {
        name : "กข29(ชัยนาถ80)",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "อายุสั้น ผลผลิตสูง ต้นแข็งไม่ล้ม",
        time : "95-105วัน"
    },
    {
        name : "กข31(ปทุมธานี80)",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "ต้านทานโรค ผลผลิตสูง",
        time : "110วัน"
    },
    {
        name : "สันป่าตอง1",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "ผลผลิตสูง ต้านทานโรคไหม้ และโรคขอบใบแห้ง",
        time : "120-125วัน"
    },
    {
        name : "กข15",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "มีกลิ่นหอม อายุเบา ทนแล้ง",
        time : "100วัน"
    },
    {
        name : "ปทุมธานี1",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "มีกลิ่นหอม ต้านทานโรค",
        time : "110-115วัน"
    },
    {
        name : "พิษณุโลก3",
        type : "นาปรัง",
        Yseason : "ปลูกในฤดูแล้ง (พ.ย. - เม.ย.)",
        Nseason : "ปลูกในฤดูฝน (พ.ค. - ต.ค.)",
        adv : "ผลผลิตสูง คุณภาพการสีดี ต้นแข็ง ไม่ล้มง่าย ข้าวสุกนุ่ม",
        time : "150วัน"
    },
];


function searchs(){
    other.classList.toggle('used');
    menu.classList.toggle('used');
    other = document.querySelector('.used');

    calendar.innerHTML = "";
}